app/controllers/archive_controller.rb

SELECT "comics".* FROM "comics" WHERE (post_date >= '2011-01-01 00:00:00.000000' AND post_date <= '2011-12-31 00:00:00.000000')
---
  def index
    @comics = Comic.current_year
    earliest_year = Comic.initial.first.created_at.year

SELECT "comics".* FROM "comics" WHERE (post_date >= '2011-01-01 00:00:00.000000' AND post_date <= '2011-12-31 00:00:00.000000')
SELECT COUNT(*) FROM "comics" WHERE (post_date >= '2010329402-01-01 00:00:00.000000' AND post_date <= '2010329402-12-31 00:00:00.000000')
---
  def show
    @loadcomics = Comic.by_year(params[:id])

    if(@loadcomics.count > 0)