app/controllers/comics_controller.rb

  def index
    #@assets = Asset.all.first

    #@previous = Comic.previous(@comics).first
    #@next = Comic.next(@comics).first

   # @comics = Comic.paginate(:page => params[:page], :per_page => 1, :conditions => ["created_at <= ?", Time.now], :order => "created_at DESC" )

    @comics = Comic.recent.first
---
SELECT "comics".* FROM "comics" WHERE (post_date < '2011-09-07 00:00:00.000000' AND post_date <= '2011-09-16 16:06:59.001837' AND disabled = false) ORDER BY created_at DESC LIMIT 1 OFFSET 0

  def show

    @comic = Comic.find(params[:id])
---
SELECT "comics".* FROM "comics" WHERE (post_date < '2011-09-08 00:00:00.000000' AND post_date <= '2011-09-16 16:20:03.993744' AND disabled = 'f') ORDER BY created_at DESC LIMIT 1 OFFSET 0

  def edit
    if user_signed_in?
      @comic = Comic.find(params[:id])
---
SELECT "comics".* FROM "comics" WHERE "comics"."id" = ? LIMIT 1  [["id", "14"]]

  def create
    @comic = Comic.new(params[:comic])

    if user_signed_in?
      respond_to do |format|
        if @comic.save
---
INSERT INTO "comics" ("body", "created_at", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "post_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)