app/views/archive/index.html.erb

		<div class="archive_area">
			<% @comics_all.comics.each do |comic| %>
---
SELECT "comics".* FROM "comics" WHERE (post_date >= '2011-01-01 00:00:00.000000' AND post_date <= '2011-12-31 00:00:00.000000')